---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarBendData.HookOrient0
source: html/53f6e950-f21f-a63c-a6cf-2420d37860e1.htm
---
# Autodesk.Revit.DB.Structure.RebarBendData.HookOrient0 Property

The orientation of the hook at the start.

## Syntax (C#)
```csharp
public RebarHookOrientation HookOrient0 { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration